In [1]:
people = {
    "first": ["Corey", 'Jane', 'John','Ayoade','Adenike'], 
    "last": ["Schafer", 'Doe', 'Doe',"Olayiwola",'Orimolade'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com', "AyoOlayi@gmail.com","Adeorim@ymail.com"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

     first       last                    email
0    Corey    Schafer  CoreyMSchafer@gmail.com
1     Jane        Doe        JaneDoe@email.com
2     John        Doe        JohnDoe@email.com
3   Ayoade  Olayiwola       AyoOlayi@gmail.com
4  Adenike  Orimolade        Adeorim@ymail.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
#to update rows and columns say change  first to firstname
df.columns = ["first_name", "last_name", "email"]

In [7]:
df

  first_name  last_name                    email
0      Corey    Schafer  CoreyMSchafer@gmail.com
1       Jane        Doe        JaneDoe@email.com
2       John        Doe        JohnDoe@email.com
3     Ayoade  Olayiwola       AyoOlayi@gmail.com
4    Adenike  Orimolade        Adeorim@ymail.com

In [8]:
#say you want to uppercase all of the columns
df.columns = [x.upper()for x in df.columns]
df

  FIRST_NAME  LAST_NAME                    EMAIL
0      Corey    Schafer  CoreyMSchafer@gmail.com
1       Jane        Doe        JaneDoe@email.com
2       John        Doe        JohnDoe@email.com
3     Ayoade  Olayiwola       AyoOlayi@gmail.com
4    Adenike  Orimolade        Adeorim@ymail.com

In [10]:
#to replace spaces in column names with underscores 
#df.columns = df.columns.str.replace(" ","_")
df.columns = df.columns.str.replace("_"," ")
df

  FIRST NAME  LAST NAME                    EMAIL
0      Corey    Schafer  CoreyMSchafer@gmail.com
1       Jane        Doe        JaneDoe@email.com
2       John        Doe        JohnDoe@email.com
3     Ayoade  Olayiwola       AyoOlayi@gmail.com
4    Adenike  Orimolade        Adeorim@ymail.com

In [11]:
df.columns = df.columns.str.replace(" ","_ ")
df

  FIRST_ NAME LAST_ NAME                    EMAIL
0       Corey    Schafer  CoreyMSchafer@gmail.com
1        Jane        Doe        JaneDoe@email.com
2        John        Doe        JohnDoe@email.com
3      Ayoade  Olayiwola       AyoOlayi@gmail.com
4     Adenike  Orimolade        Adeorim@ymail.com

In [12]:
df.columns = [x.lower()for x in df.columns]
df

  first_ name last_ name                    email
0       Corey    Schafer  CoreyMSchafer@gmail.com
1        Jane        Doe        JaneDoe@email.com
2        John        Doe        JohnDoe@email.com
3      Ayoade  Olayiwola       AyoOlayi@gmail.com
4     Adenike  Orimolade        Adeorim@ymail.com

In [13]:
#to change some not all the columns, you can pass in a dictionary
df.rename(columns={"first_ name":"first", "last_ name":"last"})

     first       last                    email
0    Corey    Schafer  CoreyMSchafer@gmail.com
1     Jane        Doe        JaneDoe@email.com
2     John        Doe        JohnDoe@email.com
3   Ayoade  Olayiwola       AyoOlayi@gmail.com
4  Adenike  Orimolade        Adeorim@ymail.com

In [14]:
df

  first_ name last_ name                    email
0       Corey    Schafer  CoreyMSchafer@gmail.com
1        Jane        Doe        JaneDoe@email.com
2        John        Doe        JohnDoe@email.com
3      Ayoade  Olayiwola       AyoOlayi@gmail.com
4     Adenike  Orimolade        Adeorim@ymail.com

In [16]:
#to make the change permanent
df.rename(columns={"first_ name":"first", "last_ name":"last"}, inplace=True)
df

     first       last                    email
0    Corey    Schafer  CoreyMSchafer@gmail.com
1     Jane        Doe        JaneDoe@email.com
2     John        Doe        JohnDoe@email.com
3   Ayoade  Olayiwola       AyoOlayi@gmail.com
4  Adenike  Orimolade        Adeorim@ymail.com

In [18]:
#to update data in our row say change last name of Adenike Orimolade to Olayiwola
df.loc[4] = ["Adenike","Olayiwola","AdeOla@gmail.com"]
df

     first       last                    email
0    Corey    Schafer  CoreyMSchafer@gmail.com
1     Jane        Doe        JaneDoe@email.com
2     John        Doe        JohnDoe@email.com
3   Ayoade  Olayiwola       AyoOlayi@gmail.com
4  Adenike  Olayiwola         AdeOla@gmail.com

In [19]:
#we can also specify the exact column using loc
df.loc[4, ["last", "email"]] = ["Orim","newemail@gm.com"]
df

     first       last                    email
0    Corey    Schafer  CoreyMSchafer@gmail.com
1     Jane        Doe        JaneDoe@email.com
2     John        Doe        JohnDoe@email.com
3   Ayoade  Olayiwola       AyoOlayi@gmail.com
4  Adenike       Orim          newemail@gm.com

In [21]:
#to change a single value
df.loc[4, "last"] = "Ayoade"
df

     first       last                    email
0    Corey    Schafer  CoreyMSchafer@gmail.com
1     Jane        Doe        JaneDoe@email.com
2     John        Doe        JohnDoe@email.com
3   Ayoade  Olayiwola       AyoOlayi@gmail.com
4  Adenike     Ayoade          newemail@gm.com

In [22]:
#to change a single value... at can also be used
df.at[4, "last"] = "Victor"
df

     first       last                    email
0    Corey    Schafer  CoreyMSchafer@gmail.com
1     Jane        Doe        JaneDoe@email.com
2     John        Doe        JohnDoe@email.com
3   Ayoade  Olayiwola       AyoOlayi@gmail.com
4  Adenike     Victor          newemail@gm.com

In [23]:
#to change email to all lower case
df["email"].str.lower()

0    coreymschafer@gmail.com
1          janedoe@email.com
2          johndoe@email.com
3         ayoolayi@gmail.com
4            newemail@gm.com
Name: email, dtype: object

In [25]:
#to make the change permanent
df["email"] = df["email"].str.lower()
df

     first       last                    email
0    Corey    Schafer  coreymschafer@gmail.com
1     Jane        Doe        janedoe@email.com
2     John        Doe        johndoe@email.com
3   Ayoade  Olayiwola       ayoolayi@gmail.com
4  Adenike     Victor          newemail@gm.com

In [26]:
#four important functions... apply, map, applymap, replace
#apply is used for calling a function on a value; can work for both series and dataframe
#for series
#e.g to see length of our email adds
df["email"].apply(len)

0    23
1    17
2    17
3    18
4    15
Name: email, dtype: int64

In [27]:
#we can use it to update value as well
def update_email(email):
    return email.upper()

In [28]:
df["email"].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
3         AYOOLAYI@GMAIL.COM
4            NEWEMAIL@GM.COM
Name: email, dtype: object

In [30]:
df["email"]=df["email"].apply(update_email)
df

     first       last                    email
0    Corey    Schafer  COREYMSCHAFER@GMAIL.COM
1     Jane        Doe        JANEDOE@EMAIL.COM
2     John        Doe        JOHNDOE@EMAIL.COM
3   Ayoade  Olayiwola       AYOOLAYI@GMAIL.COM
4  Adenike     Victor          NEWEMAIL@GM.COM

In [33]:
#to convert back to lower case' lambda function can also be used

df["email"]=df["email"].apply(lambda x:x.lower())
df

     first       last                    email
0    Corey    Schafer  coreymschafer@gmail.com
1     Jane        Doe        janedoe@email.com
2     John        Doe        johndoe@email.com
3   Ayoade  Olayiwola       ayoolayi@gmail.com
4  Adenike     Victor          newemail@gm.com

In [34]:
#to see how "apply" works with dataframe
#when we run apply on a dataframe it runs a function on each row or column of the df

df["email"].apply(len)

0    23
1    17
2    17
3    18
4    15
Name: email, dtype: int64

In [35]:
df.apply(len) #tells us the number of rows in each column

first    5
last     5
email    5
dtype: int64

In [37]:
df.apply(len, axis="columns") #this counts rightward

0    3
1    3
2    3
3    3
4    3
dtype: int64

In [38]:
len(df["email"])

5

In [39]:
#to return the first alphabetically in each column... better with numerial data
df.apply(pd.Series.min)

first               Adenike
last                    Doe
email    ayoolayi@gmail.com
dtype: object

In [41]:
#we can use lambda function as well... more useful when you have numerical data
df.apply(lambda x:x.min())

first               Adenike
last                    Doe
email    ayoolayi@gmail.com
dtype: object

In [42]:
#running apply on a series applies a function to every value in the series and running apply to a df applies
#...a function to every series in the df
#to apply a function to every individual element we use applymap
#applymap only works on df; series objects don't have the applymap method

df.applymap(len) #it applies the len function to every value/element in our df

   first  last  email
0      5     7     23
1      4     3     17
2      4     3     17
3      6     9     18
4      7     6     15

In [43]:
#to return all of them in lower case
df.applymap(str.lower)

     first       last                    email
0    corey    schafer  coreymschafer@gmail.com
1     jane        doe        janedoe@email.com
2     john        doe        johndoe@email.com
3   ayoade  olayiwola       ayoolayi@gmail.com
4  adenike     victor          newemail@gm.com

In [46]:
#The map method only works on a series; it is used for substituting a value in a series with another value
#say we want to substitute a couple of our firstnames;
#the values not assigned will take NaN i.e Not a Number

df["first"].map({"Ayoade":"Segun","John":"Jabez","Jane":"Juliet"})

0       NaN
1    Juliet
2     Jabez
3     Segun
4       NaN
Name: first, dtype: object

In [47]:
#to substitute the name we use the replace method without returning an NaN value

df["first"].replace({"Ayoade":"Segun","John":"Jabez","Jane":"Juliet"})

0      Corey
1     Juliet
2      Jabez
3      Segun
4    Adenike
Name: first, dtype: object

In [51]:
#Note that everydone done does not change the df;
#to set to the actual column....

df["first"] = df["first"].replace({"Ayoade":"Segun","John":"Jabez","Jane":"Juliet"})
df

     first       last                    email
0    Corey    Schafer  coreymschafer@gmail.com
1   Juliet        Doe        janedoe@email.com
2    Jabez        Doe        johndoe@email.com
3    Segun  Olayiwola       ayoolayi@gmail.com
4  Adenike     Victor          newemail@gm.com